#### `terraform plan` Success
<details><summary>Show Output</summary>

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/foreign-language-reader/infrastructure/runs/run-26N8ksz8mCzpFFU3

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
module.infrastructure.digitalocean_domain.main: Refreshing state... [id=foreignlanguagereader.com]
digitalocean_kubernetes_cluster.foreign_language_reader: Refreshing state... [id=2132b4c2-fd9e-496c-8419-a39da7d142f0]
module.infrastructure.digitalocean_domain.fluentlabs: Refreshing state... [id=fluentlabs.io]
module.infrastructure.module.api.random_password.application_secret: Refreshing state... [id=none]
module.infrastructure.tls_private_key.tls_private_key: Refreshing state... [id=96c5128d225c1725a7d5fda91c9f195dd1837181]
module.infrastructure.module.database.random_password.database_admin_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.content.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.content.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.module.monitoring.random_password.fluent_elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/106949055]
module.infrastructure.acme_certificate.certificate: Refreshing state... [id=5b26b697-bd46-8986-882e-8d464a869dcd]
module.infrastructure.acme_certificate.certificate_fluent_labs: Refreshing state... [id=1f925157-0a72-7ffc-0dc5-688f3f39570f]
module.infrastructure.module.content.aws_iam_user.github: Refreshing state... [id=github-spark-deploy]
module.kubernetes.aws_iam_role.service_workers: Refreshing state... [id=eks-node-group-service]
module.infrastructure.module.frontend_preprod.aws_s3_bucket.main: Refreshing state... [id=preprod.foreignlanguagereader.com]
module.infrastructure.module.frontend.aws_s3_bucket_policy.public_access: Refreshing state... [id=www.foreignlanguagereader.com]
module.infrastructure.module.frontend.aws_s3_bucket.main: Refreshing state... [id=www.foreignlanguagereader.com]
module.infrastructure.module.frontend_preprod.aws_s3_bucket_policy.public_access: Refreshing state... [id=preprod.foreignlanguagereader.com]
module.infrastructure.module.content.aws_iam_user.spark: Refreshing state... [id=spark]
module.infrastructure.module.elasticsearch.aws_iam_user.elasticsearch: Refreshing state... [id=elasticsearch]
module.infrastructure.module.content.aws_s3_bucket.content: Refreshing state... [id=fluentlabs-content]
module.kubernetes.aws_vpc.main: Refreshing state... [id=vpc-08c4330d865dc7409]
module.infrastructure.module.elasticsearch.aws_s3_bucket.backup: Refreshing state... [id=fluentlabs-elasticsearch-backups]
module.infrastructure.module.frontend_fluent_labs.aws_s3_bucket.main: Refreshing state... [id=www.fluentlabs.io]
module.infrastructure.module.database.aws_db_instance.fluentlabs: Refreshing state... [id=fluentlabs]
module.kubernetes.aws_iam_role.eks_cluster_role: Refreshing state... [id=eks-cluster-role]
module.infrastructure.aws_iam_user.github: Refreshing state... [id=foreign-language-reader-github]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_s3_bucket.main: Refreshing state... [id=preprod.fluentlabs.io]
module.infrastructure.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:165140526436:certificate/6470664d-0acf-4b67-93a9-8430119af2fa]
module.infrastructure.module.content.aws_iam_access_key.github: Refreshing state... [id=AKIASM4ZEOVSERLYTV5P]
module.infrastructure.module.content.aws_iam_access_key.spark: Refreshing state... [id=AKIASM4ZEOVSEBHLP4HO]
module.infrastructure.module.elasticsearch.aws_iam_access_key.elasticsearch: Refreshing state... [id=AKIASM4ZEOVSI6VLF73T]
module.kubernetes.aws_iam_role_policy_attachment.eks_container_read_policy: Refreshing state... [id=eks-node-group-service-20210718215214601100000001]
module.kubernetes.aws_iam_role_policy_attachment.eks_worker_node_policy: Refreshing state... [id=eks-node-group-service-20210718103029414600000001]
module.kubernetes.aws_iam_role_policy_attachment.eks_cni_policy_worker: Refreshing state... [id=eks-node-group-service-20210718103029423400000002]
module.kubernetes.aws_iam_role_policy_attachment.eks_cluster_policy: Refreshing state... [id=eks-cluster-role-20210718103605118700000001]
module.kubernetes.aws_iam_role_policy_attachment.eks_vpc_controller: Refreshing state... [id=eks-cluster-role-20210718103605121000000002]
module.infrastructure.aws_iam_access_key.github: Refreshing state... [id=AKIASM4ZEOVSADUQ77GK]
module.infrastructure.module.language_service.kubernetes_service.language_service: Refreshing state... [id=default/language-service]
module.infrastructure.module.elasticsearch.kubernetes_secret.elasticsearch_roles: Refreshing state... [id=default/elasticsearch-roles]
module.infrastructure.module.nginx_ingress.kubernetes_ingress.ingress: Refreshing state... [id=default/fluentlabs-ingress]
module.infrastructure.module.api.kubernetes_secret.elasticsearch_credentials: Refreshing state... [id=default/elasticsearch-credentials]
module.infrastructure.module.api.kubernetes_horizontal_pod_autoscaler.api_autoscale: Refreshing state... [id=default/api]
module.infrastructure.module.language_service.kubernetes_deployment.language_service: Refreshing state... [id=default/language-service]
module.infrastructure.module.nginx_ingress.kubernetes_secret.nginx_certificate: Refreshing state... [id=default/nginx-certificate]
module.infrastructure.module.content.kubernetes_service_account.prefect_agent: Refreshing state... [id=default/prefect-agent]
module.infrastructure.module.api.kubernetes_secret.api_database_credentials: Refreshing state... [id=default/api-database-credentials]
module.infrastructure.module.content.kubernetes_role_binding.prefect_agent: Refreshing state... [id=default/prefect-agent-rbac]
module.infrastructure.module.content.kubernetes_role.prefect_agent: Refreshing state... [id=default/prefect-agent-rbac]
module.infrastructure.module.api.kubernetes_service.api: Refreshing state... [id=default/api]
module.infrastructure.module.language_service.kubernetes_horizontal_pod_autoscaler.language_service_autoscale: Refreshing state... [id=default/language-service]
module.infrastructure.module.content.kubernetes_deployment.prefect: Refreshing state... [id=default/prefect-agent]
module.infrastructure.module.api.kubernetes_secret.application-secret: Refreshing state... [id=default/application-secret]
module.infrastructure.module.elasticsearch.helm_release.elasticsearch: Refreshing state... [id=elastic-operator]
module.infrastructure.module.monitoring.helm_release.sematext_logagent: Refreshing state... [id=sematext]
module.infrastructure.module.nginx_ingress.helm_release.nginx_ingress: Refreshing state... [id=nginx-ingress]
module.infrastructure.module.monitoring.helm_release.fluentd_elasticsearch: Refreshing state... [id=fluentd]
module.infrastructure.module.elasticsearch.kubernetes_secret.elasticsearch_aws_credentials: Refreshing state... [id=default/elasticsearch-s3-creds]
module.infrastructure.module.monitoring.helm_release.prometheus_operator: Refreshing state... [id=prometheus]
module.infrastructure.module.content.kubernetes_secret.spark_config: Refreshing state... [id=default/spark-config]
module.kubernetes.aws_subnet.public[2]: Refreshing state... [id=subnet-09bfc938045329b49]
module.kubernetes.aws_internet_gateway.gateway: Refreshing state... [id=igw-072010f2418cb3795]
module.kubernetes.aws_subnet.public[0]: Refreshing state... [id=subnet-03d64ea688089e7e8]
module.kubernetes.aws_subnet.public[1]: Refreshing state... [id=subnet-0c64eade2a7db2bb4]
module.infrastructure.module.elasticsearch.digitalocean_record.kibana_subdomain_dns: Refreshing state... [id=151240494]
module.infrastructure.module.api.kubernetes_deployment.api: Refreshing state... [id=default/api]
module.infrastructure.module.frontend_fluent_labs.aws_s3_bucket_policy.public_access: Refreshing state... [id=www.fluentlabs.io]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_s3_bucket_policy.public_access: Refreshing state... [id=preprod.fluentlabs.io]
module.kubernetes.aws_route_table.route_table: Refreshing state... [id=rtb-05eec23c01822e230]
module.kubernetes.aws_eks_cluster.fluentlabs: Refreshing state... [id=fluentlabsprod]
module.infrastructure.module.elasticsearch.elasticsearch_snapshot_repository.backups: Refreshing state... [id=S3-backup]
module.infrastructure.module.elasticsearch.elasticsearch_user.fluentd: Refreshing state... [id=fluentd]
module.infrastructure.module.elasticsearch.elasticsearch_user.spark: Refreshing state... [id=spark]
module.infrastructure.module.content.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::165140526436:policy/spark-deploy-role]
module.infrastructure.module.elasticsearch.elasticsearch_user.api: Refreshing state... [id=apiprod]
module.infrastructure.module.elasticsearch.aws_iam_policy.elasticsearch_backup: Refreshing state... [id=arn:aws:iam::165140526436:policy/elasticsearch-backup-role]
module.infrastructure.module.content.aws_iam_policy.spark_read: Refreshing state... [id=arn:aws:iam::165140526436:policy/spark-read-role]
module.infrastructure.module.content.aws_iam_policy.spark_write: Refreshing state... [id=arn:aws:iam::165140526436:policy/spark-write-role]
module.infrastructure.module.elasticsearch.elasticsearch_snapshot_lifecycle_policy.daily_backup: Refreshing state... [id=daily-snapshots]
module.kubernetes.aws_eks_node_group.services: Refreshing state... [id=fluentlabsprod:services]
module.kubernetes.aws_eks_addon.vpc_cni: Refreshing state... [id=fluentlabsprod:vpc-cni]
module.kubernetes.aws_eks_addon.kube_proxy: Refreshing state... [id=fluentlabsprod:kube-proxy]
module.kubernetes.aws_eks_addon.coredns: Refreshing state... [id=fluentlabsprod:coredns]
module.kubernetes.aws_eks_node_group.jobs: Refreshing state... [id=fluentlabsprod:jobs]
module.infrastructure.module.content.aws_iam_policy_attachment.deploy: Refreshing state... [id=spark-deploy-role-attach]
module.infrastructure.module.elasticsearch.elasticsearch_index_lifecycle_policy.rollover: Refreshing state... [id=logging-rollover]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_read: Refreshing state... [id=spark-read-role-attach]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_write: Refreshing state... [id=spark-write-role-attach]
module.infrastructure.module.elasticsearch.aws_iam_policy_attachment.elasticsearch_backup: Refreshing state... [id=elasticsearch-backup-role-attach]
module.infrastructure.module.elasticsearch.elasticsearch_index_template.fluentd: Refreshing state... [id=fluentd]
module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["api"]: Refreshing state... [id=151240493]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.infrastructure.module.content.helm_release.spark will be created
  + resource "helm_release" "spark" {
      + atomic                     = false
      + chart                      = "spark-operator"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "spark"
      + namespace                  = "default"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://googlecloudplatform.github.io/spark-on-k8s-operator"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                webhook:
                  enable: true
            EOT,
        ]
      + verify                     = false
      + version                    = "1.0.5"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.infrastructure.module.elasticsearch.elasticsearch_index_template.fluentd will be updated in-place
  ~ resource "elasticsearch_index_template" "fluentd" {
        id       = "fluentd"
        name     = "fluentd"
      ~ template = jsonencode(
          ~ {
              - fluentd        = {
                  - aliases        = {}
                  - index_patterns = [
                      - "logstash-*",
                    ]
                  - mappings       = {}
                  - order          = 0
                  - settings       = {
                      - index = {
                          - lifecycle = {
                              - name           = "logging-rollover"
                              - rollover_alias = "logstash-backup-alias"
                            }
                        }
                    }
                } -> null
              + index_patterns = [
                  + "logstash-*",
                ]
              + settings       = {
                  + index.lifecycle.name           = "logging-rollover"
                  + index.lifecycle.rollover_alias = "logstash-backup-alias"
                }
            }
        )
    }

  # module.infrastructure.module.frontend.aws_s3_bucket.main will be destroyed
  - resource "aws_s3_bucket" "main" {
      - acl                         = "public-read" -> null
      - arn                         = "arn:aws:s3:::www.foreignlanguagereader.com" -> null
      - bucket                      = "www.foreignlanguagereader.com" -> null
      - bucket_domain_name          = "www.foreignlanguagereader.com.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "www.foreignlanguagereader.com.s3.us-west-2.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3BJ6K6RIION7M" -> null
      - id                          = "www.foreignlanguagereader.com" -> null
      - region                      = "us-west-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - website_domain              = "s3-website-us-west-2.amazonaws.com" -> null
      - website_endpoint            = "www.foreignlanguagereader.com.s3-website-us-west-2.amazonaws.com" -> null

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - error_document = "404.html" -> null
          - index_document = "index.html" -> null
        }
    }

  # module.infrastructure.module.frontend.aws_s3_bucket_policy.public_access will be destroyed
  - resource "aws_s3_bucket_policy" "public_access" {
      - bucket = "www.foreignlanguagereader.com" -> null
      - id     = "www.foreignlanguagereader.com" -> null
      - policy = jsonencode(
            {
              - Id        = "PolicyForPublicWebsiteContent"
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:s3:::www.foreignlanguagereader.com/*"
                      - Sid       = "PublicReadGetObject"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
    }

  # module.infrastructure.module.frontend_fluent_labs.data.aws_iam_policy_document.deploy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deploy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:ListBucketMultipartUploads",
              + "s3:PutBucketWebsite",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::www.fluentlabs.io",
              + "arn:aws:s3:::www.fluentlabs.io/*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudfront:CreateInvalidation",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.infrastructure.module.frontend_fluent_labs.aws_cloudfront_distribution.s3_distribution will be created
  + resource "aws_cloudfront_distribution" "s3_distribution" {
      + aliases                        = [
          + "www.fluentlabs.io",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + target_origin_id       = "www.fluentlabs.io"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "all"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = true
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "*"
          + target_origin_id       = "www.fluentlabs.io"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "all"
                }
            }
        }

      + origin {
          + domain_name = "www.fluentlabs.io.s3.us-west-2.amazonaws.com"
          + origin_id   = "www.fluentlabs.io"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:165140526436:certificate/6470664d-0acf-4b67-93a9-8430119af2fa"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.infrastructure.module.frontend_fluent_labs.aws_iam_policy.deploy will be created
  + resource "aws_iam_policy" "deploy" {
      + arn         = (known after apply)
      + description = "IAM policy for deploying to www.fluentlabs.io"
      + id          = (known after apply)
      + name        = "www.fluentlabs.io-deploy-role"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.infrastructure.module.frontend_fluent_labs.aws_iam_policy_attachment.deploy will be created
  + resource "aws_iam_policy_attachment" "deploy" {
      + id         = (known after apply)
      + name       = "www.fluentlabs.io-deploy-role-attach"
      + policy_arn = (known after apply)
      + users      = [
          + "foreign-language-reader-github",
        ]
    }

  # module.infrastructure.module.frontend_preprod.aws_s3_bucket.main will be destroyed
  - resource "aws_s3_bucket" "main" {
      - acl                         = "public-read" -> null
      - arn                         = "arn:aws:s3:::preprod.foreignlanguagereader.com" -> null
      - bucket                      = "preprod.foreignlanguagereader.com" -> null
      - bucket_domain_name          = "preprod.foreignlanguagereader.com.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "preprod.foreignlanguagereader.com.s3.us-west-2.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3BJ6K6RIION7M" -> null
      - id                          = "preprod.foreignlanguagereader.com" -> null
      - region                      = "us-west-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - website_domain              = "s3-website-us-west-2.amazonaws.com" -> null
      - website_endpoint            = "preprod.foreignlanguagereader.com.s3-website-us-west-2.amazonaws.com" -> null

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - error_document = "404.html" -> null
          - index_document = "index.html" -> null
        }
    }

  # module.infrastructure.module.frontend_preprod.aws_s3_bucket_policy.public_access will be destroyed
  - resource "aws_s3_bucket_policy" "public_access" {
      - bucket = "preprod.foreignlanguagereader.com" -> null
      - id     = "preprod.foreignlanguagereader.com" -> null
      - policy = jsonencode(
            {
              - Id        = "PolicyForPublicWebsiteContent"
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:s3:::preprod.foreignlanguagereader.com/*"
                      - Sid       = "PublicReadGetObject"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
    }

  # module.infrastructure.module.frontend_preprod_fluent_labs.data.aws_iam_policy_document.deploy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deploy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:ListBucketMultipartUploads",
              + "s3:PutBucketWebsite",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::preprod.fluentlabs.io",
              + "arn:aws:s3:::preprod.fluentlabs.io/*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudfront:CreateInvalidation",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.infrastructure.module.frontend_preprod_fluent_labs.aws_cloudfront_distribution.s3_distribution will be created
  + resource "aws_cloudfront_distribution" "s3_distribution" {
      + aliases                        = [
          + "preprod.fluentlabs.io",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + target_origin_id       = "preprod.fluentlabs.io"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "all"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = true
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "*"
          + target_origin_id       = "preprod.fluentlabs.io"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "all"
                }
            }
        }

      + origin {
          + domain_name = "preprod.fluentlabs.io.s3.us-west-2.amazonaws.com"
          + origin_id   = "preprod.fluentlabs.io"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:165140526436:certificate/6470664d-0acf-4b67-93a9-8430119af2fa"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.infrastructure.module.frontend_preprod_fluent_labs.aws_iam_policy.deploy will be created
  + resource "aws_iam_policy" "deploy" {
      + arn         = (known after apply)
      + description = "IAM policy for deploying to preprod.fluentlabs.io"
      + id          = (known after apply)
      + name        = "preprod.fluentlabs.io-deploy-role"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.infrastructure.module.frontend_preprod_fluent_labs.aws_iam_policy_attachment.deploy will be created
  + resource "aws_iam_policy_attachment" "deploy" {
      + id         = (known after apply)
      + name       = "preprod.fluentlabs.io-deploy-role-attach"
      + policy_arn = (known after apply)
      + users      = [
          + "foreign-language-reader-github",
        ]
    }

Plan: 7 to add, 1 to change, 4 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `__hashicorp_terraform-github-actions_4`, Working Directory: `.`, Workspace: `default`*
